** start some where--demo a sin-osc
#+BEGIN_SRC clojure
(demo 5 (sin-osc))
#+END_SRC

#+RESULTS:
: #<synth-node[loading]: user/audition-synth 57>

** a simple noise with no real parameters
#+BEGIN_SRC clojure :session *cider-repl post_tonal_overtone*
(definst anoise [vol 0.5]
  (* (pink-noise)
     vol))

(anoise)
#+END_SRC

#+RESULTS:
: #<instrument: anoise>#<synth-node[loading]: user/anoise 58>

** use a "env-gen" Ugen
 #+BEGIN_SRC clojure :session getting-started :tangle yes 
(definst noisey [attack 0.01 sustain 0.4 release 0.1 vol 0.4 length 3] 
  (* (env-gen (lin attack sustain release) 1 1 0 length FREE)
     (pink-noise) ; also have (white-noise) and others...
     vol))

(noisey)
 #+END_SRC

 #+RESULTS:
 : #<instrument: noisey>#<synth-node[loading]: user/noisey 43>

** consider the some underappreciated differences about the sounds you will make
UGen vs. SynthNode!
#+BEGIN_SRC clojure
(type (sin-osc))
#+END_SRC

#+RESULTS:
: overtone.sc.machinery.ugen.sc_ugen.SCUGen

#+BEGIN_SRC clojure
(type (noisey))
#+END_SRC

#+RESULTS:
: overtone.sc.node.SynthNode

** are you connected to a controller?

#+BEGIN_SRC clojure :session *cider-repl post_tonal_overtone*
(midi-connected-devices)
#+END_SRC

#+RESULTS:
: '((:description "Axiom A.I.R. Mini32 MIDI"  :vendor "M-Audio"  :sinks 0  :sources 2147483647  :name "MIDI"  :overtone.studio.midi/full-device-key (:midi-device "M-Audio" "MIDI" "Axiom A.I.R. Mini32 MIDI" 0)  :info #object(com.sun.media.sound.MidiInDeviceProvider$MidiInDeviceInfo 0x1bc8dfb "MIDI")  :overtone.studio.midi/dev-num 0  :device #object(com.sun.media.sound.MidiInDevice 0x293855dc "com.sun.media.sound.MidiInDevice@293855dc")  :version "Unknown version") (:description "Axiom A.I.R. Mini32 HyperControl"  :vendor "M-Audio"  :sinks 0  :sources 2147483647  :name "HyperControl"  :overtone.studio.midi/full-device-key (:midi-device "M-Audio" "HyperControl" "Axiom A.I.R. Mini32 HyperControl" 0)  :info #object(com.sun.media.sound.MidiInDeviceProvider$MidiInDeviceInfo 0x7f787dc9 "HyperControl")  :overtone.studio.midi/dev-num 0  :device #object(com.sun.media.sound.MidiInDevice 0x7047162b "com.sun.media.sound.MidiInDevice@7047162b")  :version "Unknown version"))

quickly check the output dump: 

#+BEGIN_SRC clojure :results silent
(event-debug-on)
#+END_SRC

Full-fledged note on/off messages are awful. Turn it off quickly

#+BEGIN_SRC clojure :session *cider-repl post_tonal_overtone*
(event-debug-off)
#+END_SRC

#+RESULTS:
: false

** create a very simple instrument to control
#+BEGIN_SRC clojure :session *cider-repl post_tonal_overtone*
(definst boop [note 60 amp 0.3]
  (let [freq (midicps note)]
    (* amp (sin-osc freq))))

#+END_SRC

#+RESULTS:
: #<instrument: boop>

#+BEGIN_SRC clojure
(demo (boop))
#+END_SRC

#+RESULTS:
: #<synth-node[loading]: user/audition-synth 60>

** you will rely on 'midi-poly-player' to control your instrument
#+BEGIN_SRC clojure :session *cider-repl post_tonal_overtone*
(def booper (midi-poly-player boop))
#+END_SRC

#+RESULTS:
: #'user/booper

